app/controllers/admin/posts_controller.rb

INSERT INTO "posts" ("author_id", "cached_slug", "content", "created_at", "draft", "processed_content", "tag_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @post = Post.new(params[:post])
    if @post.save

UPDATE "posts" SET "title" = 'New post test!!!!!!!!!!!!!!!!!!!!', "content" = 'content fr the new post hahahahahaha', "updated_at" = '2012-10-16 02:28:33.579468' WHERE "posts"."id" = 25
---
  def update
    if @post.update_attributes(params[:post])